Revit 2026 API

# RebarSpliceUtilsGetLapDirectionForSpliceGeometryAndPosition Method

---

This function calculates the lap direction given a RebarSpliceGeometry and a RebarSplicePosition.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static XYZ GetLapDirectionForSpliceGeometryAndPosition(
	Rebar rebar,
	RebarSpliceGeometry spliceGeometry,
	RebarSplicePosition splicePosition
)
```
```vb
Public Shared Function GetLapDirectionForSpliceGeometryAndPosition (
	rebar As Rebar,
	spliceGeometry As RebarSpliceGeometry,
	splicePosition As RebarSplicePosition
) As XYZ
```
```cpp
public:
static XYZ^ GetLapDirectionForSpliceGeometryAndPosition(
	Rebar^ rebar,
	RebarSpliceGeometry^ spliceGeometry,
	RebarSplicePosition splicePosition
)
```
```fsharp
static member GetLapDirectionForSpliceGeometryAndPosition :
        rebar : Rebar *
        spliceGeometry : RebarSpliceGeometry *
        splicePosition : RebarSplicePosition -> XYZ
```

#### Parameters

rebar Rebar
     The input rebar.
spliceGeometry RebarSpliceGeometry
     The splice geometry.
splicePosition RebarSplicePosition
     The splice position.

#### Return Value

XYZ The lap direction.

| Exception | Condition |
| --- | --- |
| ArgumentException | RebarSplicePosition should not be Middle. -or- The rebar cannot be spliced with the provided RebarSpliceGeometry. |
| ArgumentNullException | A non-optional argument was null |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

This function determines first the point where the RebarSpliceGeometry will cut the rebar. Based on the RebarSplicePosition value it will determine the direction where the lap will go, RebarSplicePosition.End1 meaning towards the start of the splice chain and RebarSplicePosition.End2 towards the end. For more information about the splice chain concept please check Autodesk.Revit.DB.Structure.RebarSpliceUtils.GetSpliceChain(Rebar rebar). This function will throw exception if it's called with RebarSplicePosition.Middle.

#### Reference

RebarSpliceUtils Class

Autodesk.Revit.DB.Structure Namespace